In [43]:
import numpy as np 
import pandas as pd

In [44]:
pd.DataFrame([{'aa':1,'bb':2},{'bb':3,'cc':6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [45]:

pd.DataFrame(np.random.randint(2,12),
columns = ['chocolate','milk'],
index = ['a','b','c'])

   chocolate  milk
a          8     8
b          8     8
c          8     8

pandas index object

In [46]:
ind = pd.Index([20,30,40,50,60])
ind

Int64Index([20, 30, 40, 50, 60], dtype='int64')

INDEX AND IMMUTABLE ARRAY

In [47]:
ind[1]

30

In [48]:
ind[::]

Int64Index([20, 30, 40, 50, 60], dtype='int64')

In [49]:
ind[::-1]

Int64Index([60, 50, 40, 30, 20], dtype='int64')

In [50]:
print(ind.size,ind.shape,ind.ndim,ind.dtype)

5 (5,) 1 int64

In [51]:
print(type(ind))

<class 'pandas.core.indexes.numeric.Int64Index'>

In [ ]:
ind[1] = 0

UFUNCS : INDEX PRESERVATION

In [52]:
abc = np.random.RandomState(10)
ser = pd.Series(abc.randint(0,10,4))
ser

0    9
1    4
2    0
3    1
dtype: int32

In [53]:
dfr = pd.DataFrame(abc.randint(0,10,(5,4)),
columns = ['a','b','c','d'])
dfr

   a  b  c  d
0  9  0  1  8
1  9  0  8  6
2  4  3  0  4
3  6  8  1  8
4  4  1  3  6

In [54]:
np.exp(ser)

0    8103.083928
1      54.598150
2       1.000000
3       2.718282
dtype: float64

In [55]:
np.sin(dfr*np.pi/4)

              a             b             c             d
0  7.071068e-01  0.000000e+00  7.071068e-01 -2.449294e-16
1  7.071068e-01  0.000000e+00 -2.449294e-16 -1.000000e+00
2  1.224647e-16  7.071068e-01  0.000000e+00  1.224647e-16
3 -1.000000e+00 -2.449294e-16  7.071068e-01 -2.449294e-16
4  1.224647e-16  7.071068e-01  7.071068e-01 -1.000000e+00

universal functions : index alignment

In [56]:
area =pd.Series({'bangalore':6532667, 'chennai':986434,'delhi':938460},name = 'area')
population = pd.Series({'kolkata':43233866,'nagpur':8938583,'surat':9178628},name = 'population')
print(area)
population

bangalore    6532667
chennai       986434
delhi         938460
Name: area, dtype: int64

kolkata    43233866
nagpur      8938583
surat       9178628
Name: population, dtype: int64

In [57]:
population / area

bangalore   NaN
chennai     NaN
delhi       NaN
kolkata     NaN
nagpur      NaN
surat       NaN
dtype: float64

In [58]:
area.index | population.index

Index(['bangalore', 'chennai', 'delhi', 'kolkata', 'nagpur', 'surat'], dtype='object')

In [59]:
a = pd.Series([2,4,6],index = [0,1,2])
b = pd.Series([1,3,5],index = [1,2,3])
print(a,b)
b
a+b

0    2
1    4
2    6
dtype: int64 1    1
2    3
3    5
dtype: int64

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [60]:
a.add(b, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [61]:
data = {"city": ["bangalore", "chennai", "kerala", "mumbai", "goa"],
        "Year": [2019, 2020, 2018, 2020, 2019],
        "population(cr)": [6.0, 4.5, 3.5, 5.0, 0.5]}
print(data)
print(type(data))
pd.DataFrame(data)

{'city': ['bangalore', 'chennai', 'kerala', 'mumbai', 'goa'], 'Year': [2019, 2020, 2018, 2020, 2019], 'population(cr)': [6.0, 4.5, 3.5, 5.0, 0.5]}
<class 'dict'>

        city  Year  population(cr)
0  bangalore  2019             6.0
1    chennai  2020             4.5
2     kerala  2018             3.5
3     mumbai  2020             5.0
4        goa  2019             0.5

In [62]:
df = pd.DataFrame(data, columns=["city", "Year", "population(cr)"])
df

        city  Year  population(cr)
0  bangalore  2019             6.0
1    chennai  2020             4.5
2     kerala  2018             3.5
3     mumbai  2020             5.0
4        goa  2019             0.5

In [63]:
df['area(sqkm)'] = ['67','99','43','48','89']
df

        city  Year  population(cr) area(sqkm)
0  bangalore  2019             6.0         67
1    chennai  2020             4.5         99
2     kerala  2018             3.5         43
3     mumbai  2020             5.0         48
4        goa  2019             0.5         89

In [64]:
df['serie_aligned'] =pd.Series(range(5),index=[0,1,2,3,4])
df

        city  Year  population(cr) area(sqkm)  serie_aligned
0  bangalore  2019             6.0         67              0
1    chennai  2020             4.5         99              1
2     kerala  2018             3.5         43              2
3     mumbai  2020             5.0         48              3
4        goa  2019             0.5         89              4

In [65]:
df2 = pd.DataFrame({"city" : ['bangalore','chennai','kerala','mumbai','goa'],"blocks":['98','63','71','28','98']})
df2

        city blocks
0  bangalore     98
1    chennai     63
2     kerala     71
3     mumbai     28
4        goa     98

In [66]:
df.merge(df2)

        city  Year  population(cr) area(sqkm)  serie_aligned blocks
0  bangalore  2019             6.0         67              0     98
1    chennai  2020             4.5         99              1     63
2     kerala  2018             3.5         43              2     71
3     mumbai  2020             5.0         48              3     28
4        goa  2019             0.5         89              4     98

In [67]:
df3 = pd.DataFrame({"city":['bangalore','kerala'],"blocks":['98','71']})
df3
df.merge(df3, right_on ="city", left_on="city")

        city  Year  population(cr) area(sqkm)  serie_aligned blocks
0  bangalore  2019             6.0         67              0     98
1     kerala  2018             3.5         43              2     71

In [68]:
df4 = pd.DataFrame({"city":['bangalore','kerala','goa'],'blocks':['98','71','98']})
df.merge(df4,how= 'outer')

        city  Year  population(cr) area(sqkm)  serie_aligned blocks
0  bangalore  2019             6.0         67              0     98
1    chennai  2020             4.5         99              1    NaN
2     kerala  2018             3.5         43              2     71
3     mumbai  2020             5.0         48              3    NaN
4        goa  2019             0.5         89              4     98

In [69]:
df5 = pd.DataFrame({"city":['bangalore','kerala','goa'],'blocks':['98','71','98']})
print(df)
df.merge(df5,how='outer')

        city  Year  population(cr) area(sqkm)  serie_aligned
0  bangalore  2019             6.0         67              0
1    chennai  2020             4.5         99              1
2     kerala  2018             3.5         43              2
3     mumbai  2020             5.0         48              3
4        goa  2019             0.5         89              4

        city  Year  population(cr) area(sqkm)  serie_aligned blocks
0  bangalore  2019             6.0         67              0     98
1    chennai  2020             4.5         99              1    NaN
2     kerala  2018             3.5         43              2     71
3     mumbai  2020             5.0         48              3    NaN
4        goa  2019             0.5         89              4     98

COMBINING DATA WITH OVERLAP

In [70]:
ser_a = pd.Series([np.nan,2.5,np.nan,3.5,4.5,np.nan],index=['f','e','d','c','b','a'])
ser_b = pd.Series(np.arange(len(ser_a),dtype=np.float64),index= ['f','e','d','c','b','a'])
ser_a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [71]:
ser_b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [72]:
pd.Series(np.where(pd.isnull(ser_a),ser_b,ser_a),index=ser_a.index)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

In [73]:
ser_a.combine_first(ser_b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64